In [10]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
from sklearn.feature_extraction.text import CountVectorizer

#url = "https://raw.githubusercontent.com/hashketh/hello-world/e6eb7ca3e5e1e1d2f1d7d9571966c396928bac76/candyhierarchy2017%20(1).csv"
url = "https://github.com/ChngYuanLongRandy/DataScience/blob/main/Stats%20From%20Singstat.xlsx?raw=true"

# Reading the downloaded content and turning it into a pandas dataframe


# , encoding="ISO-8859-1"

df = pd.read_excel(url, sheet_name = "Number of Children Born")
df2 = pd.read_excel(url, sheet_name = "HH Income")

In [64]:
df.head()

,Subject: Births and Fertility,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35,Unnamed: 36
0,"Topic: Births and Fertility, Annual/ Quarterly...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Title: M810411-Average Number Of Children Born...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Per Resident Ever-married Female
4,Variables,1980.0,1984.0,1985.0,1986.0,1987.0,1988.0,1989.0,1990.0,1991.0,...,2010.0,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2018.0,2019

In [70]:
df_t=df.dropna().transpose()
df_t.reset_index(drop=True, inplace = True)

In [71]:
df_t.head()

,4,5,6,7,8,9
0,Variables,15 Years & Over,15 - 29 Years,30 - 39 Years,40 - 49 Years,50 Years & Over
1,1980,3.44,1.3,2.65,4.42,4.98
2,1984,3.16,1.19,2.24,3.69,4.81
3,1985,3.14,1.15,2.21,3.53,4.85
4,1986,3.1,1.12,2.13,3.42,4.81

In [72]:
df_t.index(1)

TypeError: 'RangeIndex' object is not callable